---
type: ElementSet
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# ElementSet

`Autodesk.Revit.DB.ElementSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ElementSet | — | `public ElementSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( Element item )` |
| Method | Erase | — | `public virtual int Erase ( Element item )` |
| Method | ForwardIterator | — | `public virtual ElementSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( Element item )` |
| Method | ReverseIterator | — | `public virtual ElementSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |